-- Системные упражнения
INSERT INTO exercise (name, description, muscle_group) VALUES
('Жим штанги лёжа', 'Базовое упражнение для развития грудных мышц', 'CHEST'),
('Жим гантелей на наклонной', 'Развитие верхнего отдела грудных мышц', 'CHEST'),
('Разводка гантелей', 'Изолирующее упражнение для растяжки грудных мышц', 'CHEST'),
('Отжимания на брусьях', 'Развитие нижнего отдела грудных мышц и трицепса', 'CHEST'),
('Пуловер с гантелью', 'Упражнение для расширения грудной клетки', 'CHEST'),
('Тяга штанги в наклоне', 'Базовое упражнение для развития толщины спины', 'BACK'),
('Тяга вертикального блока', 'Альтернатива подтягиваниям для ширины спины', 'BACK'),
('Тяга гантели в наклоне', 'Односторонняя проработка мышц спины', 'BACK'),
('Гиперэкстензия', 'Укрепление нижнего отдела спины', 'BACK'),
('Армейский жим', 'Базовое упражнение для развития плечевого пояса', 'SHOULDERS'),
('Махи гантелями в стороны', 'Изолирующее упражнение для средних пучков дельт', 'SHOULDERS'),
('Тяга штанги к подбородку', 'Развитие трапециевидных мышц и дельт', 'SHOULDERS'),
('Жим Арнольда', 'Комплексное развитие всех пучков плеч', 'SHOULDERS'),
('Приседания со штангой', 'Базовое упражнение для развития мышц ног', 'LEGS'),
('Становая тяга', 'Базовое упражнение для развития задней цепи', 'BACK'),
('Выпады с гантелями', 'Упражнение для развития ног и ягодичных мышц', 'LEGS'),
('Румынская тяга', 'Развитие бицепса бедра и ягодичных мышц', 'LEGS'),
('Подъем на носки', 'Упражнение для развития икроножных мышц', 'LEGS'),
('Подъём штанги на бицепс', 'Базовое упражнение для развития бицепса', 'ARMS'),
('Французский жим', 'Изолирующее упражнение для развития трицепса', 'ARMS'),
('Молотковые сгибания', 'Упражнение для развития брахиалиса', 'ARMS'),
('Скручивания на пресс', 'Базовое упражнение для прямой мышцы живота', 'CORE'),
('Подъем ног в висе', 'Упражнение для нижнего отдела пресса', 'CORE');

-- Демо пользователь
INSERT INTO person (username, password, name, year, height, gender, weight_unit, height_unit)
VALUES ('guest@mail.ru', '$2a$12$mf3YDBlh/srWaLwisgAABOAkM1VvuU4lnjDoWl/bGw0E0RhnKA5Ee',
        'Сергей Качков', 1992, 185, 0, 'KG', 'CM');

-- Персональные упражнения пользователя
INSERT INTO exercise (name, description, muscle_group, created_by) VALUES
      ('Качковский жим', 'Эксклюзивная техника жима', 'CHEST', 1),
      ('Медвежья тяга', 'Мощная становая от Сергея', 'BACK', 1),
      ('Качковские выпады', 'Фирменные выпады с паузой', 'LEGS', 1);

-- Вес пользователя
INSERT INTO weight (person_id, person_weight, weight_date) VALUES
      (1, 93.9, CURRENT_DATE - INTERVAL '89 days'),
      (1, 93.6, CURRENT_DATE - INTERVAL '82 days'),
      (1, 92.8, CURRENT_DATE - INTERVAL '75 days'),
      (1, 92.5, CURRENT_DATE - INTERVAL '68 days'),
      (1, 92.9, CURRENT_DATE - INTERVAL '65 days'),
      (1, 92.9, CURRENT_DATE - INTERVAL '62 days'),
      (1, 92.4, CURRENT_DATE - INTERVAL '58 days'),
      (1, 92.6, CURRENT_DATE - INTERVAL '55 days'),
      (1, 91.8, CURRENT_DATE - INTERVAL '52 days'),
      (1, 92.0, CURRENT_DATE - INTERVAL '51 days'),
      (1, 92.1, CURRENT_DATE - INTERVAL '48 days'),
      (1, 91.3, CURRENT_DATE - INTERVAL '43 days'),
      (1, 90.5, CURRENT_DATE - INTERVAL '41 days'),
      (1, 90.7, CURRENT_DATE - INTERVAL '39 days'),
      (1, 90.9, CURRENT_DATE - INTERVAL '35 days'),
      (1, 91.8, CURRENT_DATE - INTERVAL '32 days'),
      (1, 91.4, CURRENT_DATE - INTERVAL '31 days'),
      (1, 91.4, CURRENT_DATE - INTERVAL '30 days'),
      (1, 91.5, CURRENT_DATE - INTERVAL '27 days'),
      (1, 91.6, CURRENT_DATE - INTERVAL '23 days'),
      (1, 91.8, CURRENT_DATE - INTERVAL '22 days'),
      (1, 91.7, CURRENT_DATE - INTERVAL '20 days'),
      (1, 90.5, CURRENT_DATE - INTERVAL '14 days'),
      (1, 90.5, CURRENT_DATE - INTERVAL '12 days'),
      (1, 90.1, CURRENT_DATE - INTERVAL '9 days'),
      (1, 90.4, CURRENT_DATE - INTERVAL '7 days'),
      (1, 89.9, CURRENT_DATE - INTERVAL '3 days'),
      (1, 89.7, CURRENT_DATE - INTERVAL '1 day');

-- 40 тренировок
INSERT INTO workout (person_id, muscle_group, date, notes) VALUES
(1, 'CHEST', CURRENT_DATE - INTERVAL '90 days', 'Неплохо для первого раза, но всё очень болит'),
(1, 'BACK', CURRENT_DATE - INTERVAL '88 days', 'Спина хорошо откликается на нагрузку'),
(1, 'LEGS', CURRENT_DATE - INTERVAL '85 days', 'Ноги крепчают, техника улучшается'),
(1, 'SHOULDERS', CURRENT_DATE - INTERVAL '82 days', 'Плечи стали более округлыми'),
(1, 'ARMS', CURRENT_DATE - INTERVAL '79 days', 'Руки начали расти, видны первые результаты'),
(1, 'CHEST', CURRENT_DATE - INTERVAL '77 days', 'Жим пошел увереннее, веса растут'),
(1, 'BACK', CURRENT_DATE - INTERVAL '75 days', 'Ширина спины увеличивается'),
(1, 'LEGS', CURRENT_DATE - INTERVAL '72 days', 'Присед 100кг - новый рекорд!'),
(1, 'SHOULDERS', CURRENT_DATE - INTERVAL '71 days', 'Дельты стали рельефнее'),
(1, 'ARMS', CURRENT_DATE - INTERVAL '69 days', 'Бицепс +2см за месяц'),
(1, 'CHEST', CURRENT_DATE - INTERVAL '67 days', 'Грудь разделилась на пучки'),
(1, 'BACK', CURRENT_DATE - INTERVAL '65 days', 'Становая 120кг - прогресс налицо'),
(1, 'LEGS', CURRENT_DATE - INTERVAL '64 days', 'Ноги стали сильнее и выносливее'),
(1, 'SHOULDERS', CURRENT_DATE - INTERVAL '62 days', 'Плечи не подводят'),
(1, 'ARMS', CURRENT_DATE - INTERVAL '60 days', 'Руки объемные и рельефные'),
(1, 'CHEST', CURRENT_DATE - INTERVAL '59 days', 'Жим 90кг на 5 раз - отлично!'),
(1, 'BACK', CURRENT_DATE - INTERVAL '55 days', 'Спина стала толще и мощнее'),
(1, 'LEGS', CURRENT_DATE - INTERVAL '51 days', 'Ноги - моя сильная сторона'),
(1, 'SHOULDERS', CURRENT_DATE - INTERVAL '49 days', 'Плечи округлились за 3 месяца'),
(1, 'ARMS', CURRENT_DATE - INTERVAL '47 days', 'Трицепс подрос, жим улучшился'),
(1, 'CHEST', CURRENT_DATE - INTERVAL '45 days', 'Грудь хорошо пампуется'),
(1, 'BACK', CURRENT_DATE - INTERVAL '40 days', 'Тяга 130кг - продолжаю прогрессировать'),
(1, 'LEGS', CURRENT_DATE - INTERVAL '38 days', 'Присед 115кг - сила растет'),
(1, 'SHOULDERS', CURRENT_DATE - INTERVAL '36 days', 'Плечи стали более массивными'),
(1, 'ARMS', CURRENT_DATE - INTERVAL '33 days', 'Руки к лету готовы'),
(1, 'CHEST', CURRENT_DATE - INTERVAL '30 days', 'Верх груди подтянулся'),
(1, 'BACK', CURRENT_DATE - INTERVAL '27 days', 'Спина выглядит шире в футболке'),
(1, 'LEGS', CURRENT_DATE - INTERVAL '25 days', 'Ноги стали рельефнее'),
(1, 'SHOULDERS', CURRENT_DATE - INTERVAL '23 days', 'Дельты горят после тренировки'),
(1, 'ARMS', CURRENT_DATE - INTERVAL '20 days', 'Бицепс 42см - цель достигнута'),
(1, 'CHEST', CURRENT_DATE - INTERVAL '19 days', 'Жим 95кг - прогресс стабильный'),
(1, 'BACK', CURRENT_DATE - INTERVAL '17 days', 'Становая 140кг - мощно!'),
(1, 'LEGS', CURRENT_DATE - INTERVAL '15 days', 'Присед 120кг - ноги железные'),
(1, 'SHOULDERS', CURRENT_DATE - INTERVAL '14 days', 'Плечи почти идеальной формы'),
(1, 'ARMS', CURRENT_DATE - INTERVAL '12 days', 'Руки стали более симметричными'),
(1, 'CHEST', CURRENT_DATE - INTERVAL '9 days', 'Грудь достигла хорошей формы'),
(1, 'BACK', CURRENT_DATE - INTERVAL '7 days', 'Спина - моя гордость'),
(1, 'LEGS', CURRENT_DATE - INTERVAL '4 days', 'Ноги - основа моего телосложения'),
(1, 'SHOULDERS', CURRENT_DATE - INTERVAL '3 days', 'Плечи завершают образ'),
(1, 'FULL_BODY', CURRENT_DATE - INTERVAL '1 days', 'Довольно бодро, сделал всё качественно, без косяков');

-- Упражнения в тренировках
INSERT INTO workout_exercise (workout_id, exercise_id, work_weight, reps) VALUES
-- Тренировка 1:
(1, 1, 82.3, 9), (1, 2, 23.7, 9), (1, 3, 15.0, 13), (1, 4, 22.8, 11),
-- Тренировка 2:
(2, 6, 72.5, 7), (2, 7, 23.2, 11), (2, 8, 20.8, 12), (2, 9, 15.0, 16),
-- Тренировка 3:
(3, 14, 82.7, 7), (3, 15, 98.3, 6), (3, 16, 15.0, 11), (3, 17, 58.5, 9), (3, 18, 42.2, 14),
-- Тренировка 4:
(4, 10, 42.8, 7), (4, 11, 11.3, 11), (4, 12, 37.6, 7), (4, 13, 18.4, 11),
-- Тренировка 5:
(5, 19, 26.7, 9), (5, 20, 20.0, 11), (5, 21, 11.5, 13), (5, 22, 15.0, 16),
-- Тренировка 6:
(6, 1, 84.2, 8), (6, 2, 25.8, 8), (6, 3, 13.7, 14), (6, 4, 20.3, 12),
-- Тренировка 7:
(7, 6, 74.6, 6), (7, 7, 25.0, 10), (7, 8, 22.0, 11), (7, 9, 13.8, 17),
-- Тренировка 8:
(8, 14, 86.4, 6), (8, 15, 100.0, 5), (8, 16, 17.9, 10), (8, 17, 62.7, 8), (8, 18, 38.5, 15),
-- Тренировка 9:
(9, 10, 44.8, 5), (9, 11, 9.6, 13), (9, 12, 39.3, 6), (9, 13, 16.7, 12),
-- Тренировка 10:
(10, 19, 27.9, 8), (10, 20, 18.4, 12), (10, 21, 10.8, 14), (10, 22, 15.0, 15),
-- Тренировка 11:
(11, 1, 86.7, 7), (11, 2, 27.3, 10), (11, 3, 17.8, 12), (11, 4, 22.6, 13),
-- Тренировка 12:
(12, 6, 76.8, 5), (12, 7, 27.5, 9), (12, 8, 24.7, 10), (12, 9, 17.9, 15),
-- Тренировка 13:
(13, 14, 88.9, 4), (13, 15, 103.2, 4), (13, 16, 19.8, 9), (13, 17, 65.4, 7), (13, 18, 44.7, 14),
-- Тренировка 14:
(14, 10, 46.7, 4), (14, 11, 12.8, 10), (14, 12, 41.5, 5), (14, 13, 24.3, 9),
-- Тренировка 15:
(15, 19, 29.6, 7), (15, 20, 22.7, 10), (15, 21, 14.9, 10), (15, 22, 17.8, 14),
-- Тренировка 16:
(16, 1, 88.4, 6), (16, 2, 28.9, 9), (16, 3, 19.7, 11), (16, 4, 24.8, 12),
-- Тренировка 17:
(17, 6, 78.7, 4), (17, 7, 29.3, 8), (17, 8, 26.8, 9), (17, 9, 19.6, 14),
-- Тренировка 18:
(18, 14, 90.8, 3), (18, 15, 105.7, 3), (18, 16, 21.9, 8), (18, 17, 67.9, 6), (18, 18, 46.8, 13),
-- Тренировка 19:
(19, 10, 48.6, 3), (19, 11, 14.7, 9), (19, 12, 43.4, 4), (19, 13, 26.9, 8),
-- Тренировка 20:
(20, 19, 31.2, 6), (20, 20, 24.8, 9), (20, 21, 16.7, 9), (20, 22, 19.7, 13),
-- Тренировка 21:
(21, 1, 90.3, 5), (21, 2, 30.7, 8), (21, 3, 21.8, 10), (21, 4, 26.9, 11),
-- Тренировка 22:
(22, 6, 80.9, 3), (22, 7, 31.4, 7), (22, 8, 28.7, 8), (22, 9, 21.8, 13),
-- Тренировка 23:
(23, 14, 92.7, 2), (23, 15, 108.3, 2), (23, 16, 23.8, 7), (23, 17, 69.8, 5), (23, 18, 48.9, 12),
-- Тренировка 24:
(24, 10, 50.7, 2), (24, 11, 16.8, 8), (24, 12, 45.6, 3), (24, 13, 28.9, 7),
-- Тренировка 25:
(25, 19, 32.8, 5), (25, 20, 26.9, 8), (25, 21, 18.7, 8), (25, 22, 21.8, 12),
-- Тренировка 26:
(26, 1, 92.6, 4), (26, 2, 32.8, 7), (26, 3, 23.9, 9), (26, 4, 28.7, 10),
-- Тренировка 27:
(27, 6, 82.8, 2), (27, 7, 33.7, 6), (27, 8, 30.8, 7), (27, 9, 23.9, 12),
-- Тренировка 28:
(28, 14, 94.8, 1), (28, 15, 110.9, 1), (28, 16, 25.7, 6), (28, 17, 71.8, 4), (28, 18, 50.9, 11),
-- Тренировка 29:
(29, 10, 52.8, 1), (29, 11, 18.7, 7), (29, 12, 47.6, 2), (29, 13, 30.9, 6),
-- Тренировка 30:
(30, 19, 34.7, 4), (30, 20, 28.8, 7), (30, 21, 20.7, 7), (30, 22, 23.8, 11),
-- Тренировка 31:
(31, 1, 94.7, 3), (31, 2, 34.8, 6), (31, 3, 25.9, 8), (31, 4, 30.7, 9),
-- Тренировка 32:
(32, 6, 84.8, 1), (32, 7, 35.7, 5), (32, 8, 32.8, 6), (32, 9, 25.9, 11),
-- Тренировка 33:
(33, 14, 96.7, 1), (33, 15, 112.8, 1), (33, 16, 27.7, 5), (33, 17, 73.8, 3), (33, 18, 52.9, 10),
-- Тренировка 34:
(34, 10, 54.7, 1), (34, 11, 20.7, 6), (34, 12, 49.6, 1), (34, 13, 32.9, 5),
-- Тренировка 35:
(35, 19, 36.7, 3), (35, 20, 30.8, 6), (35, 21, 22.7, 6), (35, 22, 25.8, 10),
-- Тренировка 36:
(36, 1, 96.7, 2), (36, 2, 36.8, 5), (36, 3, 27.9, 7), (36, 4, 32.7, 8),
-- Тренировка 37:
(37, 6, 86.7, 1), (37, 7, 37.7, 4), (37, 8, 34.8, 5), (37, 9, 27.9, 10),
-- Тренировка 38:
(38, 14, 98.7, 1), (38, 15, 114.8, 1), (38, 16, 29.7, 4), (38, 17, 75.8, 2), (38, 18, 54.9, 9),
-- Тренировка 39:
(39, 10, 56.7, 1), (39, 11, 22.7, 5), (39, 12, 51.6, 1), (39, 13, 34.9, 4),
-- Тренировка 40:
(40, 1, 98.7, 1), (40, 6, 88.7, 3), (40, 14, 100.7, 1), (40, 19, 38.7, 4), (40, 23, 27.7, 8);

